app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sasuke"], ["author", "choji"], ["genre", "Classics"], ["price", 22], ["created_at", "2020-09-15 06:27:31.030759"], ["updated_at", "2020-09-15 06:27:31.030759"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "genre" = $1, "published_date" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["genre", "Fantasy"], ["published_date", "2020-09-07"], ["updated_at", "2020-09-15 22:18:56.640211"], ["id", 8]]
---
  def update
    @book = Book.find(params[:id])

    if @book.update_attributes(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id])